doc_imgs/flujo_general.gv
digraph {
	graph [bb="0,0,2408.2,144",
		rankdir=LR,
		size="12,6"
	];
	node [label="\N"];
	A	[fillcolor="#1C8074",
		fontcolor=white,
		height=0.5,
		label="Inicio / Login",
		pos="62.099,45",
		shape=ellipse,
		style=filled,
		width=1.725];
	B	[fillcolor="#e0e0e0",
		height=0.5,
		label="Gestión de Datos",
		pos="236.09,45",
		shape=ellipse,
		style=filled,
		width=2.0804];
	A -> B	[pos="e,160.91,45 124.22,45 132.48,45 141.07,45 149.66,45"];
	C	[fillcolor="#f5f5f5",
		height=0.5,
		label="Carga y selección de archivos",
		pos="557.47,72",
		shape=ellipse,
		style=filled,
		width=3.3884];
	B -> C	[label="Selecciona CSV",
		lp="373.24,68.367",
		pos="e,450.41,63.034 307.18,50.925 345.78,54.188 394.7,58.324 438.97,62.066"];
	D	[fillcolor="#e0e0e0",
		height=0.5,
		label="Botón Conectar a BD",
		pos="557.47,18",
		shape=ellipse,
		style=filled,
		width=2.5353];
	B -> D	[label="Selecciona BD",
		lp="373.24,40.75",
		pos="e,468.31,22.148 300.79,35.735 310.23,34.536 319.86,33.411 328.99,32.5 370.83,28.326 417.13,25.119 456.98,22.795"];
	E	[fillcolor="#f5f5f5",
		height=0.5,
		label="Describe datasets",
		pos="877.84,126",
		shape=ellipse,
		style=filled,
		width=2.0946];
	C -> E	[pos="e,815.14,115.65 638.83,85.774 663.71,90.028 691.21,94.719 716.45,99 745.08,103.86 776.59,109.17 804.04,113.78"];
	F	[fillcolor="#f5f5f5",
		height=0.5,
		label="Selecciona archivos a analizar",
		pos="877.84,72",
		shape=ellipse,
		style=filled,
		width=3.4168];
	C -> F	[pos="e,754.59,72 679.74,72 700.52,72 722.21,72 743.29,72"];
	G	[fillcolor="#f5f5f5",
		height=0.5,
		label="Funcionalidad próximamente disponible",
		pos="877.84,18",
		shape=ellipse,
		style=filled,
		width=4.4831];
	D -> G	[pos="e,716.02,18 648.85,18 666.45,18 685.43,18 704.67,18"];
	H	[fillcolor="#e0e0e0",
		height=0.5,
		label="Interfaz de Chat",
		pos="1147,72",
		shape=ellipse,
		style=filled,
		width=1.9667];
	F -> H	[pos="e,1076,72 1001.1,72 1022.7,72 1044.7,72 1064.8,72"];
	I	[fillcolor="#f5f5f5",
		height=0.5,
		label="Usuario hace pregunta",
		pos="1349.2,72",
		shape=ellipse,
		style=filled,
		width=2.6206];
	H -> I	[pos="e,1254.5,72 1218.3,72 1226.4,72 1234.7,72 1243.1,72"];
	J	[fillcolor="#f5f5f5",
		height=0.5,
		label="Chatbot responde y muestra visualizaciones",
		pos="1654.7,72",
		shape=ellipse,
		style=filled,
		width=4.8385];
	I -> J	[pos="e,1480.3,72 1443.7,72 1451.9,72 1460.3,72 1468.9,72"];
	K	[fillcolor="#e0e0e0",
		height=0.5,
		label="Depuración (opcional)",
		pos="1960.2,72",
		shape=ellipse,
		style=filled,
		width=2.6206];
	J -> K	[pos="e,1865.7,72 1829.2,72 1837.7,72 1846.1,72 1854.3,72"];
	L	[fillcolor="#f5f5f5",
		height=0.5,
		label="Ver pasos intermedios, código y salidas",
		pos="2249.9,72",
		shape=ellipse,
		style=filled,
		width=4.3978];
	K -> L	[pos="e,2091.1,72 2055,72 2063,72 2071.3,72 2079.6,72"];
}
